:PROPERTIES:
:ID:       373eed2b-8eaf-4b48-b42a-23e031290e5d
:END:
#+title: 结构体
#+filetags: cpp

* 结构体
- 结构体 :: 用户自定义的 [[id:763eae87-6088-40cf-874a-c3f915865734][复合数据类型]]，由 [[id:372c18aa-a68a-47b2-a5b8-9685e7677a69][成员变量]] 和 [[id:3a39bdbf-179e-4dd8-aaf9-3aeb1d0c3863][成员函数]] 封装而成
  1. *访问权限* 、 *继承权限* 默认为 =public=
  2. 最核心的使用场景：作为 [[id:4140e2ae-be37-4c1f-ab2b-00f2fc86f1fa][聚合体]] 使用


** 聚合体
:PROPERTIES:
:ID:       4140e2ae-be37-4c1f-ab2b-00f2fc86f1fa
:END:
- 聚合体 :: 将多种类型的成员变量封装在一起（专注于 *数据聚合* 而非封装）
  1. 支持 ={}= *聚合初始化* （非聚合体 使用 [[id:50402d44-720e-42ed-b590-2b18d219acc1][构造函数]]），常用载体是 =struct=
  2. 与 C语言兼容的 数据结构
  3. 用于 数据存储
  4. [[id:6881d753-91d9-4382-8f31-2f9315074183][constexpr]]聚合体，提高运行性能 [fn:1]
#+begin_src cpp
struct WindowConfig { // 常见使用场景：数据存储 -> 配置
    int width;
    int height;
    bool fullscreen;
    const char* title;
};
WindowConfig config = {800, 600, false, "My App"};
CreateWindow(config);
#+end_src

*有哪些？*
1. C风格数组
2. 类类型（[[id:373eed2b-8eaf-4b48-b42a-23e031290e5d][结构体]]、[[id:d63526f2-db09-4c79-8a1a-57d6a7d82ec9][类]]、联合体）[fn:2]
   需满足以下条件：
   1) 无 private/public的 非static成员变量
   2) 无 引用类型的 非static成员变量
   3) 无 用户声明的构造函数
   4) 无 用户声明的拷贝/移动赋值运算符
   5) 无 [[id:b23cd926-82ec-489e-ad8f-96b86e5559c2][虚函数]]、虚基类

* Footnotes

[fn:1]
#+begin_src cpp :results output :namespaces std :includes <iostream>
struct RGB {
    uint8_t r, g, b;
};

// 必须初始化
constexpr RGB colors[] = {
    {255, 0, 0},   // 红
    {0, 255, 0},   // 绿
    {0, 0, 255}    // 蓝
};
#+end_src

[fn:2]
#+begin_src cpp :results output :namespaces std :includes <iostream>
class Date {
public:                // private/public 不能使用聚合初始化
    int m_year {};
    int m_month {};
    const int m_day {};
    static int s_day;
    // int& m_hour;    FIXME 引用类型 不能使用聚合初始化

    void print() const {
        cout << m_year << " " << m_month << " " << m_day << " " << s_day << endl;
    }
};

int Date::s_day {1};

int main() {
    Date today { 1997, 10, 22};
    today.print();
}
#+end_src

#+RESULTS:
: 1997 10 22 1
